app/controllers/urls_controller.rb

    def index
        @urls = Url.all
---
SELECT "urls".* FROM "urls"

    def show
    # byebug
        @url = Url.find(params[:id])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        # @url = Url.new(params[:url])
        @url = Url.new(url_params)
        @url.shorten
    if @url.save
---
INSERT INTO "urls" ("long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long_url", "http://url-shortener-alexteo.c9users.io:8080/urls/new"], ["short_url", "9268b8f2"], ["created_at", 2017-03-20 06:52:28 UTC], ["updated_at", 2017-03-20 06:52:28 UTC]]

    def destroy
        @url = Url.find(params[:id])
        @url.destroy
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "urls" WHERE "urls"."id" = $1  [["id", 2]]